Функция ВозможныеВладельцыПоказателей() Экспорт
	
	Результат = Новый Массив;
	
	ПоказателиОбъектовСлужебный.ОбновитьСлужебныеСправочники();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбъектыМетаданныхПО.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОбъектыМетаданныхПО КАК ОбъектыМетаданныхПО
		|ГДЕ
		|	ОбъектыМетаданныхПО.МожетИметьПоказатели
		|	И НЕ ОбъектыМетаданныхПО.ПометкаУдаления";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПервыйПопавшийсяВладелецПоказателя() Экспорт
	
	ВладельцыПоказателей = ВозможныеВладельцыПоказателей();
	
	Если ВладельцыПоказателей.Количество() = 0 Тогда
		ВызватьИсключение
			НСтр("ru = 'Не определены объекты с показателями.
				 |См. ПоказателиОбъектовПереопределяемый.ОпределитьОбъектыСПоказателями'");
	КонецЕсли;
	
	Возврат ВладельцыПоказателей[0];
	
КонецФункции